load_test/output-load-test-get-example-item.txt
k6 run load-test.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ is status 200

     checks.........................: 100.00% 2636 out of 2636
     data_received..................: 13 MB   107 kB/s
     data_sent......................: 287 kB  2.4 kB/s
     http_req_blocked...............: avg=710.19µs min=0s     med=0s     max=151.95ms p(90)=1µs     p(95)=2µs     
     http_req_connecting............: avg=8.76µs   min=0s     med=0s     max=3.19ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=24.79ms  min=2.47ms med=8.91ms max=602.82ms p(90)=48.98ms p(95)=100.37ms
       { expected_response:true }...: avg=24.79ms  min=2.47ms med=8.91ms max=602.82ms p(90)=48.98ms p(95)=100.37ms
     http_req_failed................: 0.00%   0 out of 2636
     http_req_receiving.............: avg=213.16µs min=13µs   med=62µs   max=26.18ms  p(90)=296.5µs p(95)=570.74µs
     http_req_sending...............: avg=71.13µs  min=8µs    med=37µs   max=10.16ms  p(90)=100µs   p(95)=151µs   
     http_req_tls_handshaking.......: avg=697.19µs min=0s     med=0s     max=150.27ms p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=24.51ms  min=2.39ms med=8.68ms max=602.72ms p(90)=48.88ms p(95)=100.31ms
     http_reqs......................: 2636    21.915416/s
     iteration_duration.............: avg=1.02s    min=1s     med=1.01s  max=1.6s     p(90)=1.05s   p(95)=1.1s    
     iterations.....................: 2636    21.915416/s
     vus............................: 1       min=1            max=50
     vus_max........................: 50      min=50           max=50


running (2m00.3s), 00/50 VUs, 2636 complete and 0 interrupted iterations
default ✓ [======================================] 00/50 VUs  2m0s